app/Controllers/student.php

    public function index()
    {
        $studentmodel = new \App\Models\StudentModel();
        $data['studentdata'] =  $studentmodel->findAll();
---
SELECT *
FROM `tbl_student`

    public function add()
    {

        helper('form');
        $studentmodel = new \App\Models\StudentModel();
        $data = [];
        if($this->request->getMethod() === 'POST'){

        $rules = [
            'lastname' => 'required',
            'firstname' => 'required',
            'middlename' => 'required',
        ];

        if (!$this->validate($rules)){
            $data['validation'] = $this->validator;
        }else {
            $studentmodel->insert($_POST);
---
INSERT INTO `tbl_student` (`lastname`, `firstname`, `middlename`) VALUES ('Lazy', 'John', 'Doe')