app/Controllers/user.php

SELECT *
FROM `tbl_user`
---
    public function index()
    {
        $usermodel = new \App\Models\UserModel();
        $data['userdata'] =  $usermodel->findAll();